app/Controllers/Home.php

    public function tables(): string
    {
        // Load UserModel
        $model = new UserModel();

        // Fetch all users from the database
        $data['users'] = $model->findAll();
---
SELECT *
FROM `users`