app/Controllers/SigninController.php

    public function loginAuth(){
        $session=session();
        $userModel=new UserModel();
        $email=$this->request->getVar('email');
        $password=$this->request->getVar('password');
        $data=$userModel->where('email',$email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'ahirepriya80@gmail.com'
 LIMIT 1

    public function edit($id)
    {
        $userModel = new UserModel();
        $user = $userModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '18'