app/Models/CompanyModel.php

    public function insertClient($data)
    {
        // Insert data into the client table
        return $this->db->table('clients')->insert($data);
    }
   /*  public function getclient()
    {
        return $this->db->table('clients')->get()->getResultArray();
---
INSERT INTO `clients` (`client_name`, `client_email`, `client_location`, `status`, `client_address`) VALUES ('piya', 'piya@gmail.com', 'nandel', 'inactive', 'tapovan ,pune')
SELECT *
FROM `clients`

    public function updateStatus($clientId, $status)
{
    // Update the status in the 'clients' table
    $data = ['status' => $status]; // Data to be updated
    $this->db->table('clients')->where('client_id', $clientId)->update($data);
---
UPDATE `clients` SET `status` = 'inactive'
WHERE `client_id` = '11'
SELECT *
FROM `clients`
WHERE `client_id` = '10'

    public function updateClient($clientId, $data)
{
    // Update the client's details in the 'clients' table
    $this->db->table('clients')->where('client_id', $clientId)->update($data);
---
UPDATE `clients` SET `is_deleted` = 1
WHERE `client_id` = '10'

public function getclient()
{
    return $this->db->table('clients')
                    ->where('is_deleted', 0) // Filter out deleted clients
                    ->get()
                    ->getResultArray();
---
SELECT *
FROM `clients`
WHERE `is_deleted` = 0

public function getProjects()
{
    return $this->db->table('projects')
                    ->select('projects.*, clients.client_name')
                    ->join('clients', 'clients.client_id = projects.client_id')
                    ->where('projects.is_deleted', 0) // Adding condition for not deleted projects
                    ->get()
                    ->getResultArray();
---
SELECT `projects`.*, `clients`.`client_name`
FROM `projects`
JOIN `clients` ON `clients`.`client_id` = `projects`.`client_id`
WHERE `projects`.`is_deleted` = 0

public function getSEOProjects()
{
    return $this->db->table('seo_projects')
                    ->select('seo_projects.*, seo_projects.project_name')
                    ->join('projects', 'projects.project_id = seo_projects.project_id')
                    ->get()
                    ->getResultArray();
---
SELECT `seo_projects`.*, `seo_projects`.`project_name`
FROM `seo_projects`
JOIN `projects` ON `projects`.`project_id` = `seo_projects`.`project_id`